MAX_CONCURRENT_TASKS = 5
TOTAL_TASKS = 100
REQUEST_TIMEOUT = 2

CHROME_OPTIONS = [
    # '--headless', #: безголовний режим роботи браузера

    # '--start-maximized', #: максимізувати вікно браузера після запуску
    # '--no-sandbox', #: запускати браузер без піщаного ящика(sandbox)
    # '--disable-gpu', #: вимкнути підтримку GPU в браузері
    # '--user-data-dir=/tmp/user-data', #: вказати шлях до каталогу з користувацькими даними
    # '--hide-scrollbars', #: приховати полосу прокрутки в браузері

    # '--disable-logging', #: вимкнути логування
    '--enable-logging',  #: включити логування
    '--log-level=0',  #: встановити рівень логування на 0(найнижчий рівень)
    '--v=99',  #: встановити рівень подробиць логування на 99
    '--data-path=/tmp/data-path',  #: вказати шлях до  каталогу з даними
    '--ignore-certificate-errors',  #: ігнорувати помилки сертифікатів HTTPS
    # '--homedir=/tmp', #: вказати домашній каталог для браузера
    '--disk-cache-dir=/tmp/cache-dir',  #: вказати шлях до каталогу з кешем
    # '--disable-blink-features=AutomationControlled', #: вимкнути певні функції браузера, які використовуються для автоматизації.
    '--disable-extensions',  #: вимкнути всі розширення браузера
    '--disable-popup-blocking',  #: вимкнути блокування виринаючих вікон
    '--disable-infobars',  #: вимкнути інформаційну панель браузера
    # '--disable-notifications',  #: вимкнути сповіщення браузера
    # '--disable-translate',  #: вимкнути автоматичний переклад сторінок
    # '--disable-web-security',  #: вимкнути політику безпеки мережі Same-Origin
    # '--window-position=0,0',  #: встановити позицію вікна браузера в лівий верхній кут екрану
    # '--disable-remote-fonts',  #: вимкнути завантаження шрифтів з віддалених серверів
    # '--disable-background-networking',  #: вимкнути фонову мережеву діяльність браузера
    # '--disable-default-apps',  #: вимкнути встановлені за замовчуванням додатки браузера
    # '--disable-client-side-phishing-detection',  #: вимкнути захист від фішингу на клієнтському боці
    # '--disable-sync',  #: вимкнути синхронізацію даних між браузером та Google-аккаунтом
    # '--disable-accelerated-video',  #: вимкнути прискорення відео
    # '--disable-accelerated-2d-canvas',  #: вимкнути прискорення 2D-холсту
    # '--disable-dev-shm-usage',  #: вимкнути використання /dev/shm для тимчасових файлів
    # '--disable-setuid-sandbox',  #: вимкнути піщаний ящик на рівні системи
    # '--disable-background-timer-throttling',  #: вимкнути затримки таймерів у фонових вкладка
    #
    # '--ignore-ssl-errors=yes',
    # '--ignore-certificate-errors',
    # '--disable-blink-features=AutomationControlled',

    'user-agent=Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/110.0.0.0 Safari/537.36',
    #: встановити користувацький рядок агента
]

HTTP_PROXY_LIST = [
    '8.219.176.202:8080',
    '46.101.239.193:80',
    '64.225.8.191:9987',
    '8.219.97.248:80',
    '217.76.50.200:8000',
    '103.152.9.131:80',
    '182.16.12.30:8088',
    '45.62.167.249:80',
    '20.191.183.149:3129',
    '210.148.141.4:8080',
    '40.119.236.22:80',
    '178.33.3.163:8080',
    '64.225.4.63:9998',
    '146.59.192.125:3128',
    '190.109.205.253:999',
    '110.164.208.125:8888',
    '194.67.91.153:80',
    '117.54.114.99:80',
    '182.93.85.225:8080',
    '89.43.10.141:80',
    '117.54.114.96:80',
    '20.210.113.32:80',
    '35.246.142.152:80',
    '170.80.202.252:999',
    '138.197.102.119:80',
    '156.17.193.1:80',
    '95.183.140.89:80',
    '97.74.92.60:80',
    '102.223.20.217:80',
    '51.68.124.241:80',
    '51.75.141.46:80',
    '82.79.213.118:9812',
    '47.74.71.208:2080',
    '167.71.191.74:80',
    '61.29.96.146:8000',
    '51.68.181.108:80',
    '78.28.152.111:80',
    '34.100.152.46:80',
    '210.148.141.1:8080',
    '54.39.183.55:3128',
    '54.39.187.70:3128',
    '54.39.187.70:3128',
    '158.101.113.18:80',
    '54.39.183.55:3128',
    '64.225.8.132:9983',
    '165.227.81.188:9995',
    '46.41.141.111:8080',
    '5.189.184.6:80',
    '177.66.192.221:80',
    '23.236.70.37:45787',
    '46.101.126.180:42911',
    '103.225.87.5:45787',
    '8.219.176.202:8080',
    '43.250.172.225:45787',
    '13.71.80.61:80',
    '43.249.11.151:45787',
    '23.236.65.241:45787',
    '121.54.190.25:45787',
    '167.172.96.117:45711',
    '158.69.53.132:5566',
    '34.219.156.153:80',
    '167.172.172.234:33607',
    '157.230.241.133:35621',
    '43.250.172.211:45787',
    '8.218.247.144:80',
    '34.133.61.49:8118',
    '68.183.230.116:37961',
    '45.251.138.171:45787',
    '103.42.183.106:45787',
    '54.39.190.146:3128',
    '54.39.177.175:3128',
    '95.213.135.148:3128',
    '110.145.200.50:10000',
]

CSS_SELECTOR = (
    "span.lex_ful_tran",
    "span.lex_ful_entr.l1",
    "span.lex_ful_pron",
    "span.lex_ful_morf",
    "span.lex_ful_form"
)
